app/Controllers/Kaos_anak.php

    public function kaos_anak()
    { //untuk pencarian data menggunakan method post atau get//
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $anak = $this->AnakModel->cari($keyword);
        } else {
            $anak = $this->AnakModel;
        }
        //end//

        $nomor_list = $this->request->getVar('page_anak') ? $this->request->getVar('page_anak') : 1;


        $data = [

            'anak' => $anak->paginate(10, 'anak'),
---
SELECT *
FROM `anak`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `anak`